# DoorFinish Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DoorFinish Property
ParameterTypeId Class See Also
---
"Finish"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DoorFinish { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DoorFinish As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DoorFinish {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace